Revit 2024 API
ReferencePoint.GetPointElementReference Method
Retrieve a copy of the rule that computes the location of the ReferencePoint relative to other elements in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PointElementReference GetPointElementReference()
Visual Basic
Public Function GetPointElementReference As PointElementReference
Visual C++
public:
PointElementReference^ GetPointElementReference()
Return Value
A PointElementReference object, or null if the ReferencePoint does not have a reference.
See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace